[
  {
    "Etape": "S - S’intégrer au projet",
    "Objectif": "L'objectif de cette étape est de prendre connaissance du contexte lié à l'application. Afin de faire progresser efficacement le niveau de sécurité, nous nous concentrons sur la vision du métier. Les éléments importants pour le métier seront les éléments à sécuriser en priorité.",
    "Ateliers": [
      {
        "Nom": "S1 : Présentation du projet par les équipes de développement",
        "Prerequis": null,
        "Poids":  1,
        "Processus": [
          {
            "Nom": "Présentation des fonctions métier",
            "Fin": true
          },
          {
            "Nom": "Mise à disposition de la documentation (DAT, cartographies)",
            "Fin": false
          },
          {
            "Nom": "Accès au code source et/ou à l'application",
            "Fin": false
          },
          {
            "Nom": "Le cas échéant: accès aux résultats des précédentes recettes et rapports des tests d’intrusion",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "La liste des fonctions métier"
          },
          { "Nom": "Accusé de réception des documents transmis" },

          { "Nom": "Confirmation que l'accès aux sources et/ou à l'application est fonctionnel" }
        ]
      },
      {
        "Nom": "S2 : (optionnel) Participation en tant qu’observateurs à une ou plusieurs réunions clés",
        "Prerequis": "S1",
        "Poids":  1,
        "Processus": [
          {
            "Nom": "SCRUM, Kanban, point projet",
            "Fin": false
          },
          {
            "Nom": "COPIL, COSEC et autres comitologies",
            "Fin": false
          },
          {
            "Nom": "Échange entre le projet et les équipes en charge de la SSI",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "Compte rendu comportant la liste des échanges et les éléments pris en compte" 
          }
        ]
      }
    ]
  },
  {
    "Etape": "I - Identifier les fonctions sensibles",
    "Objectif": "Le travail et l'atelier ci-dessous sont des étapes itératives qui consistent à élaborer et faire valider la liste précise et exhaustive des fonctions qui feront l'objet d'une sécurisation. L'itération se répète jusqu'à obtenir un niveau de maturité satisfaisant.",
    "Ateliers": 
    [
      {
        "Nom": "I1 : Identification des fonctions sensibles",
        "Prerequis": "S",
        "Poids": 2,
        "Processus": [
          {
            "Nom": "Analyse des éléments fournis par le projet",
            "Fin": false
          },
          {
            "Nom": "Élaboration d’une liste exhaustive des fonctions sensibles du point de vue du métier, comportant des enjeux pour la sécurité - en s'appuyant notamment sur les méthodes de modélisation des menaces",
            "Fin": false
          }
        ],
        "Livrables": 
        [
          { "Nom": "Proposition d'une liste exhaustive des fonctions sensibles du point de vue du métier et leurs enjeux pour la sécurité" }
        ]
      },
      {
        "Nom": "I2 : Validation des fonctions sensibles",
        "Prerequis": "I1",
        "Poids":  1,
        "Processus": 
        [
          {
            "Nom": "Le projet et le métier challengent (retour I2) ou valident le travail (passage à l''étape M)",
            "Fin": false
          }
        ],
        "Livrables": 
        [
          {
            "Nom": "La liste définitive des fonctions métier"
          },
          {
            "Nom": "L'étude des enjeux de sécurité / modélisation des menaces justifiant la liste définitive" 
          }
        ]
      }
    ]
  },
  {
    "Etape": "M - Maitriser les objectifs de sécurité",
    "Objectif": "Une fois les éléments à sécuriser définis, il est nécessaire de connaitre les besoins de sécurité. L’étape vise à établir la jonction entre le métier et les objectifs du RSSI pour que l'effort de sécurisation coïncide avec les exigences de sécurité",
    "Ateliers": [
      {
        "Nom": "M1 : Recueil des objectifs de sécurité de l’organisation",
        "Prerequis": "I",
        "Poids": 1,
        "Processus": [
          {
            "Nom": "Recueil les objectifs de sécurité du projet : Règlementation, normes, objectif PSSI",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "Accusé de réception : Liste des documents reçus et utilisés pour l'étude"
          }
        ]
      },
      {
        "Nom": "M2 : définition des besoins de sécurité du projet",
        "Prerequis": "M1",
        "Poids": 4,
        "Processus": [
          {
            "Nom": "Élaboration de la liste des besoins / exigences de sécurité pour chaque fonction sensible (étape I) à partir des objectifs de l’organisation",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "Liste des besoins retenus pour la sécurisation des fonctions métier"
          },
          {
            "Nom": "Proposition d'un ratio: besoins pris en compte / durée de la prestation" 
          }
        ]
      }
    ]
  },
  {
    "Etape": "P : Proposer des mesures de sécurité",
    "Objectif": "En plus d'être efficaces, les mesures de sécurité doivent être compréhensibles, réalistes et implémentables pour le projet. Le travail et l'atelier ci-dessous sont des étapes itératives qui consistent à élaborer et faire valider les mesures de sécurité retenue. Ces ateliers se répètent jusqu'à obtenir un niveau de maturité satisfaisant.",
    "Ateliers": [
      {
        "Nom": "P1 : Identification des mesures de sécurité",
        "Prerequis": "M",
        "Poids": 3,
        "Processus": [
          {
            "Nom": "Élaborer la liste des mesures techniques de sécurité à implémenter, en adéquation avec chaque fonction sensible portée par le projet, la menace et les exigeances de sécurité",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "Proposition d'une liste de mesure de sécurité à implémenter par le projet." 
          }
        ]
      },
      {
        "Nom": "P2 : Validation des mesures de sécurité",
        "Prerequis": "P1",
        "Poids":  1,
        "Processus": [        
          {
            "Nom": "Challenge ou validation des mesures par le projet et par la sécurité",
            "Fin": false
          }
        ],
        "Livrables": [
          { "Nom": "Liste définitive des mesures de sécurité à implémenter par le projet" } 
        ]
      }
    ]
  },
  {
    "Etape": "L - Limiter la charge pour le projet",
    "Objectif": "Cette étape vise à fournir l'accompagnement nécessaire pour l'implémentation des mesures de sécurité et les vérifications à mettre en place avant leur passage en production.",
    "Ateliers": [
      {
        "Nom": "L1 : Accompagnement pour l’implémentation des mesures de sécurité",
        "Prerequis": "P",
        "Poids": 5,
        "Processus": [
          {
            "Nom": "Apporter les réponses aux questions du projet lors de l’implémentation réalisée par les équipes de développement",
            "Fin": false
          },
          {
            "Nom": "Apporter une expertise technique quant aux difficultés rencontrées lors de l'implémentation",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "Comptes rendus d'ateliers"
          } 
        ]
      },
      {
        "Nom": "L2 : Accompagnement à l’élaboration de jeux de tests",
        "Prerequis": "L1",
        "Poids":  10,
        "Processus": [
          {
            "Nom": "En liaison étroite avec le projet élaboration de jeux de tests adaptés parmi les possibilités suivantes : Tests unitaires,SAST,DAST,IAST",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "Les éléments fournis au projet"
          },
          {
            "Nom": "Les points discutés et les réponses apportées"
          }
        ]
      }
    ]
  },
  {
    "Etape": "E - Évaluer l’efficacité des mesures implémentées",
    "Objectif": "Cette dernière étape vérifie que le niveau de sécurité visé est bien atteint. Des éléments complémentaires sont transmis au projet afin qu'il puisse poursuivre l'effort de sécurisation en autonomie.",
    "Ateliers": [
      {
        "Nom": "E1 : Test de l’application",
        "Prerequis": "L",
        "Poids":  6,
        "Processus": [
          {
            "Nom": "Réalisation d’une recette de sécurité vérifiant chaque mesure de sécurité",
            "Fin": false
          },
          {
            "Nom": "Possibilité de test d’intrusion en boite blanche",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "PV de recette ou rapport d'audit"
          }
        ]
      },
      {
        "Nom": "E2 : Livraison",
        "Prerequis": "E1",
        "Poids":  2,
        "Processus": [
          {
            "Nom": "Mise en forme et rédaction des livrables",
            "Fin": false
          },
          {
            "Nom": "Après signature du procès-verbal de livraison: suppression des données de la prestation, à l'exception du PV de livraison",
            "Fin": false
          }
        ],
        "Livrables": [
          {
            "Nom": "Outillage et du processus de tests (E1) afin que le projet soit autonome"
          },
          {
            "Nom": "éventuelles recommandations supplémentaires permettant de poursuivre la sécurisation du projet"
          },
          {
            "Nom": "PV de livraison"
          }
        ]
      }
    ]
  }

]